Revit 2024 API
Curve.IsBound Property
Describes whether the parameter of the curve is restricted to a particular interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsBound { get; }
Visual Basic
Public ReadOnly Property IsBound As Boolean
	Get
Visual C++
public:
property bool IsBound {
	bool get ();
}
See Also
Curve Class
Autodesk.Revit.DB Namespace